; domain
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;; DOMAIN: warehouse (Fully Documented Standard Version)
;;
;; Purpose:
;; This domain models a warehouse picking system where:
;;   - Workers execute commands (orders)
;;   - Products must be picked by type and location
;;   - Zone-based scanning controls workflow progression
;;   - Each order must pass per-type checkpoints before completion
;;
;; Workflow:
;;   Start Mission → Print Label → Move → Scan Zone →
;;   Pick Items → Verify Checkpoints → Finalize Order
;;
;; Key Concepts:
;;   - Commands represent customer orders
;;   - Products are assigned and picked per order
;;   - Each product type requires zone validation
;;   - Workers must not move with open picking zones
;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(define (domain warehouse)

    (:requirements
        :strips
        :typing
        :negative-preconditions
        :universal-preconditions
        :quantified-preconditions
        :disjunctive-preconditions
    )

    (:types
        product
        product-type
        command
        worker
        location
    )

    (:predicates

        ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
        ;; WORKER LOCATION AND STATE
        ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

        (at ?w - worker ?l - location)                 ;; Worker position in warehouse
        (free ?w - worker)                             ;; Worker is not assigned to a command
        (working-on ?w - worker ?c - command)          ;; Worker is actively executing a command

        ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
        ;; COMMAND STATE
        ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

        (mission-started ?c - command)                 ;; Command has been activated
        (command-complete ?c - command)                ;; Command fully completed

        ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
        ;; INVENTORY AND ASSIGNMENT
        ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

        (in-inventory ?p - product)                    ;; Product is still available in stock
        (assigned ?p - product ?c - command)           ;; Product assigned to a command

        ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
        ;; LOCATION STRUCTURE
        ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

        (start-loc ?l - location)                      ;; Starting/control location for workers
        (type-zone ?t - product-type ?l - location)    ;; Location corresponds to product-type zone

        ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
        ;; PRODUCT INFORMATION
        ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

        (is-type ?p - product ?t - product-type)       ;; Product belongs to a type
        (at-loc ?p - product ?l - location)            ;; Product is physically at a location

        ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
        ;; COMMAND REQUIREMENTS
        ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

        (requires-type ?c - command ?t - product-type) ;; Order requires product type
        (required-product ?c - command ?p - product)    ;; Specific product required by command

        ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
        ;; ZONE CONTROL / WORKFLOW TRACKING
        ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

        (zone-open ?w - worker ?c - command ?t - product-type)
                                                      ;; Worker has an active picking session for a type

        (checkpoint-verified ?t - product-type ?c - command)
                                                      ;; All required checks completed for a type

        (order-label-printed ?c - command)             ;; Order label has been printed
    )

    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
    ;; ACTION: New-mission-PDA-and-print-order-label
    ;;
    ;; Purpose:
    ;;     Initialize a command and assign it to a worker.
    ;;
    ;; Preconditions:
    ;;     - Worker must be free
    ;;     - Worker must be at a start location
    ;;     - Command must not already be started
    ;;
    ;; Effects:
    ;;     - Worker becomes assigned to command
    ;;     - Command is marked as started
    ;;     - Worker is no longer free
    ;;
    ;; Workflow Stage:
    ;;     Mission initialization / dispatch
    ;;
    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

    (:action New-mission-PDA-and-print-order-label

        :parameters (?w - worker ?c - command ?l - location)

        :precondition
        (and
            (free ?w)
            (at ?w ?l)
            (start-loc ?l)
            (not (mission-started ?c))
        )

        :effect
        (and
            (not (free ?w))
            (working-on ?w ?c)
            (mission-started ?c)
        )
    )

    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
    ;; ACTION: Print-order-label
    ;;
    ;; Purpose:
    ;;     Generate and attach order label for tracking.
    ;;
    ;; Preconditions:
    ;;     - Worker is assigned to command
    ;;     - Label has not yet been printed
    ;;
    ;; Effects:
    ;;     - Order label becomes available
    ;;
    ;; Workflow Stage:
    ;;     Order preparation / identification
    ;;
    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

    (:action Print-order-label

        :parameters (?w - worker ?c - command)

        :precondition
        (and
            (working-on ?w ?c)
            (not (order-label-printed ?c))
        )

        :effect
        (order-label-printed ?c)
    )

    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
    ;; ACTION: move
    ;;
    ;; Purpose:
    ;;     Move worker between locations while ensuring safe workflow.
    ;;
    ;; Preconditions:
    ;;     - Worker is assigned to a command
    ;;     - Worker is at origin location
    ;;     - No active zone sessions exist
    ;;
    ;; Effects:
    ;;     - Worker changes location
    ;;
    ;; Constraint:
    ;;     - Worker cannot leave a zone while a picking session is open
    ;;
    ;; Workflow Stage:
    ;;     Navigation / warehouse traversal
    ;;
    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

    (:action move

        :parameters (?w - worker ?c - command ?from - location ?to - location)

        :precondition
        (and
            (working-on ?w ?c)
            (at ?w ?from)

            ;; ensure no open zone sessions
            (forall (?t - product-type)
                (not (zone-open ?w ?c ?t))
            )
        )

        :effect
        (and
            (not (at ?w ?from))
            (at ?w ?to)
        )
    )

    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
    ;; ACTION: Scan-item-type
    ;;
    ;; Purpose:
    ;;     Open a picking session for a product type in a zone.
    ;;
    ;; Preconditions:
    ;;     - Worker is in correct zone location
    ;;     - Location corresponds to product type zone
    ;;     - No existing open session for this type
    ;;
    ;; Effects:
    ;;     - Zone session becomes active
    ;;
    ;; Workflow Stage:
    ;;     Zone validation / picking setup
    ;;
    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

    (:action Scan-item-type

        :parameters (?w - worker ?c - command ?t - product-type ?l - location)

        :precondition
        (and
            (working-on ?w ?c)
            (at ?w ?l)
            (type-zone ?t ?l)
            (not (zone-open ?w ?c ?t))
        )

        :effect
        (zone-open ?w ?c ?t)
    )

    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
    ;; ACTION: add-to-order
    ;;
    ;; Purpose:
    ;;     Pick a product and assign it to a command.
    ;;
    ;; Preconditions:
    ;;     - Worker is in active picking session
    ;;     - Product is at worker location
    ;;     - Product matches required type
    ;;     - Product is still in inventory
    ;;
    ;; Effects:
    ;;     - Product is removed from inventory
    ;;     - Product is assigned to command
    ;;
    ;; Workflow Stage:
    ;;     Picking / order fulfillment
    ;;
    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

    (:action add-to-order

        :parameters (?w - worker ?c - command ?p - product ?t - product-type ?l - location)

        :precondition
        (and
            (working-on ?w ?c)
            (at ?w ?l)
            (at-loc ?p ?l)
            (is-type ?p ?t)
            (zone-open ?w ?c ?t)
            (in-inventory ?p)
        )

        :effect
        (and
            (not (in-inventory ?p))
            (assigned ?p ?c)
        )
    )

    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
    ;; ACTION: Scan-order-label
    ;;
    ;; Purpose:
    ;;     Verify completion of all required products in a zone.
    ;;
    ;; Preconditions:
    ;;     - Worker is in correct zone
    ;;     - Zone session is active
    ;;     - All required products are assigned
    ;;
    ;; Effects:
    ;;     - Zone is marked as completed
    ;;     - Picking session is closed
    ;;
    ;; Workflow Stage:
    ;;     Checkpoint validation
    ;;
    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

    (:action Scan-order-label

        :parameters (?w - worker ?c - command ?t - product-type ?l - location)

        :precondition
        (and
            (working-on ?w ?c)
            (at ?w ?l)
            (type-zone ?t ?l)
            (zone-open ?w ?c ?t)

            ;; ensure all required products are assigned
            (forall (?p - product)
                (imply
                    (required-product ?c ?p)
                    (assigned ?p ?c)
                )
            )
        )

        :effect
        (and
            (not (zone-open ?w ?c ?t))
            (checkpoint-verified ?t ?c)
        )
    )

    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
    ;; ACTION: finish-command-print-label-scan-finished-codebar-and-leave-in-controlzone
    ;;
    ;; Purpose:
    ;;     Finalize a command after all zones are validated.
    ;;
    ;; Preconditions:
    ;;     - Worker is assigned to command
    ;;     - All required product-type checkpoints are verified
    ;;     - No zone sessions are open
    ;;
    ;; Effects:
    ;;     - Worker becomes free
    ;;     - Command is completed
    ;;
    ;; Workflow Stage:
    ;;     Order completion / checkout
    ;;
    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

    (:action finish-command-print-label-scan-finished-codebar-and-leave-in-controlzone

        :parameters (?w - worker ?c - command)

        :precondition
        (and
            (working-on ?w ?c)

            ;; all required types checked
            (forall (?t - product-type)
                (imply
                    (requires-type ?c ?t)
                    (checkpoint-verified ?t ?c)
                )
            )

            ;; no active picking sessions
            (forall (?t - product-type)
                (not (zone-open ?w ?c ?t))
            )
        )

        :effect
        (and
            (free ?w)
            (not (working-on ?w ?c))
            (command-complete ?c)
        )
    )

)

; problem
(define (problem warehouse-test)

  (:domain warehouse)

  (:objects

      worker1 - worker

      cmd1 cmd2 - command

      typeA typeB - product-type

      locStart locA locB - location

      a1 a2 b1 b2 - product

  )

  (:init

      ;; worker position
      (free worker1)
      (at worker1 locStart)

      ;; start location
      (start-loc locStart)

      ;; type zones
      (type-zone typeA locA)
      (type-zone typeB locB)

      ;; products and locations
      (is-type a1 typeA)
      (is-type a2 typeA)

      (is-type b1 typeB)
      (is-type b2 typeB)

      (at-loc a1 locA)
      (at-loc a2 locA)

      (at-loc b1 locB)
      (at-loc b2 locB)

      ;; inventory
      (in-inventory a1)
      (in-inventory a2)
      (in-inventory b1)
      (in-inventory b2)

      ;; command requirements
      (requires-type cmd1 typeA)
      (requires-type cmd1 typeB)

      (requires-type cmd2 typeA)
      (requires-type cmd2 typeB)

  )

    (:goal
        (and
            (command-complete cmd1)
            (command-complete cmd2)

            ;; FORCE actual picking
            (assigned a1 cmd1)
            (assigned b1 cmd1)

            (assigned a2 cmd2)
            (assigned b2 cmd2)
        )
    )   

)

; plan
1. (new-mission-pda-and-print-order-label worker1 cmd1 locstart)
   deleted: (free worker1)
   added: (working-on worker1 cmd1) (mission-started cmd1)
   goals met: 0 of 6
2. (move worker1 cmd1 locstart loca)
   deleted: (at worker1 locstart)
   added: (at worker1 loca)
   goals met: 0 of 6
3. (scan-item-type worker1 cmd1 typea loca)
   added: (zone-open worker1 cmd1 typea)
   goals met: 0 of 6
4. (add-to-order worker1 cmd1 a1 typea loca)
   deleted: (in-inventory a1)
   added: (assigned a1 cmd1)
   goals met: 1 of 6
5. (scan-order-label worker1 cmd1 typea loca)
   deleted: (zone-open worker1 cmd1 typea)
   added: (checkpoint-verified typea cmd1)
   goals met: 1 of 6
6. (move worker1 cmd1 loca locb)
   deleted: (at worker1 loca)
   added: (at worker1 locb)
   goals met: 1 of 6
7. (scan-item-type worker1 cmd1 typeb locb)
   added: (zone-open worker1 cmd1 typeb)
   goals met: 1 of 6
8. (add-to-order worker1 cmd1 b1 typeb locb)
   deleted: (in-inventory b1)
   added: (assigned b1 cmd1)
   goals met: 2 of 6
9. (scan-order-label worker1 cmd1 typeb locb)
   deleted: (zone-open worker1 cmd1 typeb)
   added: (checkpoint-verified typeb cmd1)
   goals met: 2 of 6
10. (move worker1 cmd1 locb locstart)
   deleted: (at worker1 locb)
   added: (at worker1 locstart)
   goals met: 2 of 6
11. (finish-command-print-label-scan-finished-codebar-and-leave-in-controlzone worker1 cmd1)
   deleted: (working-on worker1 cmd1)
   added: (free worker1) (command-complete cmd1)
   goals met: 3 of 6
12. (new-mission-pda-and-print-order-label worker1 cmd2 locstart)
   deleted: (free worker1)
   added: (working-on worker1 cmd2) (mission-started cmd2)
   goals met: 3 of 6
13. (move worker1 cmd2 locstart loca)
   deleted: (at worker1 locstart)
   added: (at worker1 loca)
   goals met: 3 of 6
14. (scan-item-type worker1 cmd2 typea loca)
   added: (zone-open worker1 cmd2 typea)
   goals met: 3 of 6
15. (add-to-order worker1 cmd2 a2 typea loca)
   deleted: (in-inventory a2)
   added: (assigned a2 cmd2)
   goals met: 4 of 6
16. (scan-order-label worker1 cmd2 typea loca)
   deleted: (zone-open worker1 cmd2 typea)
   added: (checkpoint-verified typea cmd2)
   goals met: 4 of 6
17. (move worker1 cmd2 loca locb)
   deleted: (at worker1 loca)
   added: (at worker1 locb)
   goals met: 4 of 6
18. (scan-item-type worker1 cmd2 typeb locb)
   added: (zone-open worker1 cmd2 typeb)
   goals met: 4 of 6
19. (add-to-order worker1 cmd2 b2 typeb locb)
   deleted: (in-inventory b2)
   added: (assigned b2 cmd2)
   goals met: 5 of 6
20. (scan-order-label worker1 cmd2 typeb locb)
   deleted: (zone-open worker1 cmd2 typeb)
   added: (checkpoint-verified typeb cmd2)
   goals met: 5 of 6
21. (finish-command-print-label-scan-finished-codebar-and-leave-in-controlzone worker1 cmd2)
   deleted: (working-on worker1 cmd2)
   added: (free worker1) (command-complete cmd2)
   goals met: 6 of 6
